backend/load-tests/basic-load-test.yml
# Prueba de carga básica para TESTheb
# Ejecutar con: artillery run load-tests/basic-load-test.yml

config:
  target: "http://localhost:3000"
  phases:
    # Fase 1: Calentamiento - 10 usuarios por segundo durante 30 segundos
    - duration: 30
      arrivalRate: 10
      name: "Warm up"

    # Fase 2: Carga normal - 50 usuarios por segundo durante 60 segundos
    - duration: 60
      arrivalRate: 50
      name: "Normal load"

    # Fase 3: Pico de carga - 100 usuarios por segundo durante 30 segundos
    - duration: 30
      arrivalRate: 100
      name: "Peak load"

    # Fase 4: Carga sostenida - 50 usuarios durante 60 segundos
    - duration: 60
      arrivalRate: 50
      name: "Sustained load"

  # Umbrales de rendimiento aceptable
  ensure:
    maxErrorRate: 1  # Máximo 1% de errores
    p95: 1000        # 95% de requests deben responder en menos de 1000ms
    p99: 2000        # 99% de requests deben responder en menos de 2000ms

scenarios:
  # Escenario 1: Navegación de catálogo (el más común)
  - name: "Browse catalog"
    weight: 60  # 60% de usuarios hacen esto
    flow:
      - get:
          url: "/api/products"
          capture:
            - json: "$[0].id"
              as: "productId"
      - think: 2  # Esperar 2 segundos (simular lectura)
      - get:
          url: "/api/products/{{ productId }}"
      - think: 3
      - get:
          url: "/api/categories"

  # Escenario 2: Búsqueda de productos
  - name: "Search products"
    weight: 20
    flow:
      - get:
          url: "/api/products?search=polera"
      - think: 2
      - get:
          url: "/api/products?search=bordado"

  # Escenario 3: Ver categorías
  - name: "Browse categories"
    weight: 15
    flow:
      - get:
          url: "/api/categories"
      - think: 2
      - get:
          url: "/api/products/category/1"

  # Escenario 4: Health check
  - name: "Health checks"
    weight: 5
    flow:
      - get:
          url: "/api/health"