backend/load-tests/homepage-performance.yml
# PRUEBA DE TIEMPO DE CARGA - PÁGINA DE INICIO
# Objetivo: Medir tiempos de respuesta de todos los endpoints que carga la HomePage
# Ejecutar con: artillery run load-tests/homepage-performance.yml

config:
  target: "http://localhost:3000"
  phases:
    # Simular carga real de usuarios visitando la home
    - duration: 120
      arrivalRate: 20
      name: "Carga de HomePage - 20 usuarios/seg"

  ensure:
    # Tiempos muy estrictos para página de inicio
    p50: 300   # 50% de requests deben responder en < 300ms
    p95: 800   # 95% de requests deben responder en < 800ms
    p99: 1500  # 99% de requests deben responder en < 1500ms
    maxErrorRate: 0.5  # Máximo 0.5% de errores

scenarios:
  # Simular exactamente lo que hace HomePage.jsx al cargar
  - name: "Carga completa de página de inicio"
    flow:
      # 1. Health check (verifica que el servidor esté activo)
      - get:
          url: "/api/health"
          capture:
            - json: "$.message"
              as: "status"

      # 2. Cargar productos destacados (HomePage usa esto)
      - get:
          url: "/api/products"
          capture:
            - json: "$"
              as: "products"
            - json: "$[0].id"
              as: "firstProductId"

      # 3. Cargar categorías (para el menú)
      - get:
          url: "/api/categories"
          capture:
            - json: "$"
              as: "categories"

      # 4. Cargar estadísticas del dashboard (si está en HomePage)
      - get:
          url: "/api/stats/dashboard"

      - think: 2  # Usuario mira la página

      # 5. Ver detalle de primer producto destacado
      - get:
          url: "/api/products/{{ firstProductId }}"

      - think: 1