backend/load-tests/stress-test.yml
# PRUEBA DE ESTRÉS - TESTheb
# Objetivo: Encontrar el punto de quiebre del servidor simulando usuarios simultáneos
# Ejecutar con: artillery run load-tests/stress-test.yml

config:
  target: "http://localhost:3000"
  phases:
    # Fase 1: Inicio suave - 10 usuarios simultáneos
    - duration: 60
      arrivalRate: 10
      name: "Fase 1: 10 usuarios/seg"

    # Fase 2: Carga moderada - 25 usuarios simultáneos
    - duration: 60
      arrivalRate: 25
      name: "Fase 2: 25 usuarios/seg"

    # Fase 3: Carga alta - 50 usuarios simultáneos
    - duration: 60
      arrivalRate: 50
      name: "Fase 3: 50 usuarios/seg"

    # Fase 4: Carga muy alta - 100 usuarios simultáneos
    - duration: 60
      arrivalRate: 100
      name: "Fase 4: 100 usuarios/seg"

    # Fase 5: Carga extrema - 200 usuarios simultáneos
    - duration: 60
      arrivalRate: 200
      name: "Fase 5: 200 usuarios/seg"

    # Fase 6: Carga crítica - 500 usuarios simultáneos
    - duration: 60
      arrivalRate: 500
      name: "Fase 6: 500 usuarios/seg (ESTRÉS MÁXIMO)"

    # Fase 7: Recuperación - 50 usuarios simultáneos
    - duration: 60
      arrivalRate: 50
      name: "Fase 7: Recuperación - 50 usuarios/seg"

  # NO definir umbrales estrictos - queremos ver hasta dónde aguanta
  # ensure:
  #   maxErrorRate: 50  # Permitir hasta 50% de errores para ver el límite

  # Configuración de timeouts más permisiva para prueba de estrés
  timeout: 30

  # Configurar para recolectar más métricas (comentado para evitar errores de ruta)
  # processor: "./load-tests/stress-processor.js"

scenarios:
  # Escenario realista: Navegación completa de un usuario
  - name: "Usuario navegando TESTheb"
    weight: 100
    flow:
      # 1. Visitar home (página de inicio)
      - get:
          url: "/api/health"
          capture:
            - json: "$.message"
              as: "healthStatus"

      - think: 1

      # 2. Cargar productos para la página de inicio
      - get:
          url: "/api/products"
          capture:
            - json: "$[0].id"
              as: "productId"

      - think: 2  # Usuario mira productos

      # 3. Ver categorías
      - get:
          url: "/api/categories"

      - think: 1

      # 4. Ver detalle de un producto
      - get:
          url: "/api/products/{{ productId }}"

      - think: 3  # Usuario lee descripción

      # 5. Buscar productos
      - get:
          url: "/api/products?search=bordado"

      - think: 2

      # 6. Ver stats (si es admin)
      - get:
          url: "/api/stats/dashboard"

      - think: 1