backend/load-tests/webpay-load-test.yml
# Prueba de carga para flujo de pagos WebPay
# Ejecutar con: artillery run load-tests/webpay-load-test.yml

config:
  target: "http://localhost:3000"
  phases:
    # Simular flujo de compra más realista (menos concurrencia)
    - duration: 120
      arrivalRate: 10  # 10 usuarios por segundo es razonable para pagos
      name: "Purchase flow"

  ensure:
    maxErrorRate: 5  # Pagos pueden fallar más (validaciones, etc.)
    p95: 2000
    p99: 5000

scenarios:
  # Escenario completo de compra
  - name: "Complete purchase flow"
    flow:
      # 1. Ver productos
      - get:
          url: "/api/products"
          capture:
            - json: "$[0].id"
              as: "productId"
            - json: "$[0].price"
              as: "productPrice"

      - think: 3  # Usuario mira productos

      # 2. Ver detalle del producto
      - get:
          url: "/api/products/{{ productId }}"

      - think: 5  # Usuario lee descripción, decide comprar

      # 3. Crear transacción de pago
      - post:
          url: "/api/webpay/create"
          json:
            amount: "{{ productPrice }}"
            sessionId: "test-session-{{ $randomNumber() }}"
            orderData:
              customerInfo:
                name: "Test Customer"
                email: "customer{{ $randomNumber() }}@test.com"
                phone: "+56912345678"
                address: "Test Address 123"
                city: "Santiago"
              cartItems:
                - product_id: "{{ productId }}"
                  quantity: 1
                  price: "{{ productPrice }}"
          capture:
            - json: "$.token"
              as: "paymentToken"
            - json: "$.url"
              as: "paymentUrl"

      - think: 2  # Simular redirección a WebPay

      # Nota: No podemos simular el commit real porque requiere
      # interacción con Transbank, pero podemos medir la creación